Repository: reoqoo/gwiotapi
Catalog: ios/demo/GWIoTAPIDemo/Supporting Files/InfoPlist/*.lproj/InfoPlist.strings
Languages: cs, fa, id, ja, ko, ms, sk, th, vi, zh_hans, zh_hant

# NSLocationWhenInUseUsageDescription
source: Require location authorization to help smart devices to connect with Wifi during connection process and confirm whether the App enters into ap mode or not( LAN working mode of mobile phone and smart devices) enable or not?
cs: Potřebujete informace o poloze, chcete-li, aby vaše místo poskytlo přizpůsobenou službu, je povoleno používat cílení?
fa: نیاز به اطلاعات مکان برای دریافت موقعیت مکانی شما برای ارائه یک سرویس سفارشی. آیا امکان استفاده از هدفگذاری وجود دارد؟
id: Perlu informasi lokasi untuk mendapatkan lokasi Anda untuk menyediakan layanan yang disesuaikan. Apakah diizinkan menggunakan penargetan?
ja: カスタマイズされたサービスを提供するためにあなたの場所を取得するために場所情報が必要です，ターゲティングを使用できますか？
ko: 맞춤 서비스를 제공하기 위해 위치 정보를 얻으려면 위치 정보가 필요합니다. 타겟팅을 사용할 수 있습니까?
ms: Perlu maklumat lokasi untuk mendapatkan lokasi anda untuk menyediakan perkhidmatan tersuai. Adakah dibenarkan untuk menggunakan penyasaran?
sk: Potrebujeme informácie o polohe, aby ste získali vašu polohu na poskytovanie prispôsobenej služby. Je povolené používať zacielenie?
th: ต้องการข้อมูลตำแหน่งเพื่อรับตำแหน่งของคุณเพื่อให้บริการที่กำหนดเอง อนุญาตให้ใช้การกำหนดเป้าหมายหรือไม่
vi: Cần thông tin vị trí để có được vị trí của bạn để cung cấp một dịch vụ tùy chỉnh. Được phép sử dụng nhắm mục tiêu?
zh_hans: 需要定位权限来帮助智慧设备在添加过程中连接WiFi和判断App是否进入ap模式（手机与智慧设备的局域网工作模式），是否允许？
zh_hant: 需要定位許可權來幫助智慧設備在添加過程中連接WiFi和判斷App是否進入ap模式（手機與智慧設備的局域網工作模式），是否允許？

# NSLocationAlwaysAndWhenInUseUsageDescription
source: Require location authorization to help smart devices to connect with Wifi during connection process and confirm whether the App enters into ap mode or not( LAN working mode of mobile phone and smart devices) enable or not?
cs: Potřebujete informace o poloze, chcete-li, aby vaše místo poskytlo přizpůsobenou službu, je povoleno používat cílení?
fa: نیاز به اطلاعات مکان برای دریافت موقعیت مکانی شما برای ارائه یک سرویس سفارشی. آیا امکان استفاده از هدفگذاری وجود دارد؟
id: Perlu informasi lokasi untuk mendapatkan lokasi Anda untuk menyediakan layanan yang disesuaikan. Apakah diizinkan menggunakan penargetan?
ja: カスタマイズされたサービスを提供するためにあなたの場所を取得するために場所情報が必要です，ターゲティングを使用できますか？
ko: 맞춤 서비스를 제공하기 위해 위치 정보를 얻으려면 위치 정보가 필요합니다. 타겟팅을 사용할 수 있습니까?
ms: Perlu maklumat lokasi untuk mendapatkan lokasi anda untuk menyediakan perkhidmatan tersuai. Adakah dibenarkan untuk menggunakan penyasaran?
sk: Potrebujeme informácie o polohe, aby ste získali vašu polohu na poskytovanie prispôsobenej služby. Je povolené používať zacielenie?
th: ต้องการข้อมูลตำแหน่งเพื่อรับตำแหน่งของคุณเพื่อให้บริการที่กำหนดเอง อนุญาตให้ใช้การกำหนดเป้าหมายหรือไม่
vi: Cần thông tin vị trí để có được vị trí của bạn để cung cấp một dịch vụ tùy chỉnh. Được phép sử dụng nhắm mục tiêu?
zh_hans: 需要定位权限来帮助智慧设备在添加过程中连接WiFi和判断App是否进入ap模式（手机与智慧设备的局域网工作模式），是否允许？
zh_hant: 需要定位許可權來幫助智慧設備在添加過程中連接WiFi和判斷App是否進入ap模式（手機與智慧設備的局域網工作模式），是否允許？

# NSLocationAlwaysUsageDescription
source: Require location authorization to help smart devices to connect with Wifi during connection process and confirm whether the App enters into ap mode or not( LAN working mode of mobile phone and smart devices) enable or not?
cs: Potřebujete informace o poloze, chcete-li, aby vaše místo poskytlo přizpůsobenou službu, je povoleno používat cílení?
fa: نیاز به اطلاعات مکان برای دریافت موقعیت مکانی شما برای ارائه یک سرویس سفارشی. آیا امکان استفاده از هدفگذاری وجود دارد؟
id: Perlu informasi lokasi untuk mendapatkan lokasi Anda untuk menyediakan layanan yang disesuaikan. Apakah diizinkan menggunakan penargetan?
ja: カスタマイズされたサービスを提供するためにあなたの場所を取得するために場所情報が必要です，ターゲティングを使用できますか？
ko: 맞춤 서비스를 제공하기 위해 위치 정보를 얻으려면 위치 정보가 필요합니다. 타겟팅을 사용할 수 있습니까?
ms: Perlu maklumat lokasi untuk mendapatkan lokasi anda untuk menyediakan perkhidmatan tersuai. Adakah dibenarkan untuk menggunakan penyasaran?
sk: Potrebujeme informácie o polohe, aby ste získali vašu polohu na poskytovanie prispôsobenej služby. Je povolené používať zacielenie?
th: ต้องการข้อมูลตำแหน่งเพื่อรับตำแหน่งของคุณเพื่อให้บริการที่กำหนดเอง อนุญาตให้ใช้การกำหนดเป้าหมายหรือไม่
vi: Cần thông tin vị trí để có được vị trí của bạn để cung cấp một dịch vụ tùy chỉnh. Được phép sử dụng nhắm mục tiêu?
zh_hans: 需要定位权限来帮助智慧设备在添加过程中连接WiFi和判断App是否进入ap模式（手机与智慧设备的局域网工作模式），是否允许？
zh_hant: 需要定位許可權來幫助智慧設備在添加過程中連接WiFi和判斷App是否進入ap模式（手機與智慧設備的局域網工作模式），是否允許？

# NSLocationUsageDescription
source: Require location authorization to help smart devices to connect with Wifi during connection process and confirm whether the App enters into ap mode or not( LAN working mode of mobile phone and smart devices) enable or not?
cs: Potřebujete informace o poloze, chcete-li, aby vaše místo poskytlo přizpůsobenou službu, je povoleno používat cílení?
fa: نیاز به اطلاعات مکان برای دریافت موقعیت مکانی شما برای ارائه یک سرویس سفارشی. آیا امکان استفاده از هدفگذاری وجود دارد؟
id: Perlu informasi lokasi untuk mendapatkan lokasi Anda untuk menyediakan layanan yang disesuaikan. Apakah diizinkan menggunakan penargetan?
ja: カスタマイズされたサービスを提供するためにあなたの場所を取得するために場所情報が必要です，ターゲティングを使用できますか？
ko: 맞춤 서비스를 제공하기 위해 위치 정보를 얻으려면 위치 정보가 필요합니다. 타겟팅을 사용할 수 있습니까?
ms: Perlu maklumat lokasi untuk mendapatkan lokasi anda untuk menyediakan perkhidmatan tersuai. Adakah dibenarkan untuk menggunakan penyasaran?
sk: Potrebujeme informácie o polohe, aby ste získali vašu polohu na poskytovanie prispôsobenej služby. Je povolené používať zacielenie?
th: ต้องการข้อมูลตำแหน่งเพื่อรับตำแหน่งของคุณเพื่อให้บริการที่กำหนดเอง อนุญาตให้ใช้การกำหนดเป้าหมายหรือไม่
vi: Cần thông tin vị trí để có được vị trí của bạn để cung cấp một dịch vụ tùy chỉnh. Được phép sử dụng nhắm mục tiêu?
zh_hans: 需要定位权限来帮助智慧设备在添加过程中连接WiFi和判断App是否进入ap模式（手机与智慧设备的局域网工作模式），是否允许？
zh_hant: 需要定位許可權來幫助智慧設備在添加過程中連接WiFi和判斷App是否進入ap模式（手機與智慧設備的局域網工作模式），是否允許？

# NSPhotoLibraryUsageDescription
source: Reoqoo requires your permission to access the photo library in order to use the QR code scanning feature.
cs: Reoqoo vyžaduje vaše souhlas s udělením přístupu k albu pro použití funkce skenování QR kódů
fa: Reoqoo requires your permission to grant access to the album in order to use the QR code scanning function
id: Reoqoo perlu izin Anda untuk mengotorisasi akses album agar dapat menggunakan fungsi pemindaian kode QR.
ja: QRコードのスキャン機能を利用するには、Reoqooはアルバムへのアクセス権限が必要です
ko: Reoqoo는 QR 코드 스캔 기능을 사용하기 위해 앨범 접근을 허용해야 합니다
ms: Reoqoo memerlukan kebenaran anda untuk mengakses album untuk menggunakan ciri pengimbasan kod QR
sk: Reoqoo si vyžaduje vaše povolenie udeliť prístup k albumu na použitie funkcie skenovania kódov QR
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตการใช้อัลบั้มรูป เพื่อใช้ฟังก์ชันการสแกนรหัส QR
vi: Reoqoo cần bạn cấp quyền truy cập Album để sử dụng tính năng quét mã QR
zh_hans: Reoqoo需要您允许授权相册访问权限，以便使用二维码扫描功能
zh_hant: Reoqoo需要您允許授權相冊訪問權限，以便使用二維碼掃描功能

# NSPhotoLibraryAddUsageDescription
source: Reoqoo requires your permission to access the photo library in order to save device QR codes to the system album.
cs: Reoqoo vyžaduje vaše svolení k autorizaci použití alba za účelem uložení QR kódu zařízení do systémového alba
fa: Reoqoo نیاز به اجازه شما برای اجازه استفاده از آلبوم برای ذخیره کردن کد دستگاه QR به آلبوم سیستم است
id: Reoqoo perlu izin Anda untuk mengotorisasi penggunaan album untuk menyimpan kode QR perangkat ke album sistem.
ja: デバイスのQRコードをシステムのアルバムに保存するには、Reoqooはアルバムへのアクセス権限が必要です
ko: Reoqoo는 장치 QR 코드를 시스템 앨범에 저장하기 위해 앨범 접근을 허용해야 합니다
ms: Reoqoo memerlukan kebenaran anda untuk mengakses album untuk menyimpan kod QR peranti ke album sistem
sk: Reoqoo vyžaduje vaše povolenie povoliť používanie albumu s cieľom uložiť kód QR zariadenia do systémového albumu
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตการใช้อัลบั้มรูป เพื่อบันทึกรหัส QR ของอุปกรณ์ลงในอัลบั้มรูปภาพของระบบ
vi: Reoqoo cần bạn cấp quyền sử dụng Album để lưu mã QR của thiết bị vào Album hệ thống
zh_hans: Reoqoo需要您允许授权相册使用权限，以便将设备二维码保存到系统相册
zh_hant: Reoqoo需要您允許授權相冊使用權限，以便將設備二維碼保存到系統相冊

# NSCameraUsageDescription
source: Reoqoo requires your permission to access the camera to use the QR code scanning feature.
cs: Reoqoo vyžaduje vaše svolení k autorizaci použití kamery pro použití funkce skenování QR kódu
fa: Reoqoo نیاز به اجازه شما برای اجازه استفاده از دوربین برای استفاده از فعالیت اسکن کد QR
id: Reoqoo perlu izin Anda untuk mengotorisasi penggunaan kamera agar dapat menggunakan fungsi pemindaian kode QR.
ja: QRコードのスキャン機能を利用するには、Reoqooはカメラへのアクセス権限が必要です。
ko: Reoqoo는 QR 코드 스캔 기능을 사용하기 위해 카메라 접근을 허용해야 합니다
ms: Reoqoo memerlukan kebenaran anda untuk mengakses kamera untuk menggunakan ciri pengimbasan kod QR
sk: Reoqoo vyžaduje vaše povolenie povoliť používanie kamery na použitie funkcie skenovania kódu QR
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตการใช้กล้องถ่ายรูป เพื่อใช้ฟังก์ชันการสแกนรหัส QR
vi: Reoqoo cần bạn cấp quyền sử dụng Camera để sử dụng tính năng quét mã QR
zh_hans: Reoqoo需要您允许授权相机使用权限，以便使用二维码扫描功能
zh_hant: Reoqoo需要您允許授權相機使用權限，以便使用二維碼掃描功能

# NSBluetoothPeripheralUsageDescription
source: Reoqoo requires your permission to access the Bluetooth in order to access Bluetooth devices.
cs: Reoqoo vyžaduje vaše svolení k autorizaci oprávnění k použití Bluetooth pro přístup k zařízením Bluetooth
fa: Reoqoo requires your permission to authorize Bluetooth usage permissions in order to access Bluetooth devices
id: Reoqoo perlu izin Anda untuk mengotorisasi penggunaan Bluetooth untuk mengakses perangkat Bluetooth.
ja: Bluetooth機器にアクセスするには、ReoqooはBluetoothへのアクセス権限が必要です。
ko: Reoqoo는 블루투스 장치에 접근할 수 있도록 블루투스 접근을 허용해야 합니다
ms: Reoqoo memerlukan kebenaran anda untuk mengakses Bluetooth untuk mengakses peranti Bluetooth
sk: Reoqoo vyžaduje vaše povolenie na povolenie používania Bluetoothu s cieľom prístupu k zariadeniam Bluetooth
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตการใช้บลูทู ธ เพื่อเข้าถึงอุปกรณ์บลูทู ธ
vi: Reoqoo cần bạn cấp quyền sử dụng Bluetooth để truy cập các thiết bị Bluetooth
zh_hans: Reoqoo需要您允许授权蓝牙使用权限，以便访问蓝牙设备
zh_hant: Reoqoo需要您允許授權藍牙使用權限，以便訪問藍牙設備

# NSMicrophoneUsageDescription
source: Reoqoo requires your permission to access the microphone to use the intercom feature.
cs: Reoqoo vyžaduje vaše svolení k použití mikrofonu pro použití funkce interkomu
fa: Reoqoo requires your permission to authorize the use of the microphone in order to use the intercom function
id: Reoqoo perlu izin Anda untuk mengotorisasi penggunaan mik agar dapat menggunakan fungsi interkom.
ja: 双方向通話機能を利用するには、Reoqooはマイクへのアクセス権限が必要です
ko: Reoqoo는 통화 기능을 사용할 수 있도록 마이크 접근을 허용해야 합니다
ms: Reoqoo memerlukan kebenaran anda untuk mengakses mikrofon untuk menggunakan ciri interkom
sk: Reoqoo vyžaduje vaše povolenie povoliť používanie mikrofónu na použitie funkcie interkomu
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตไมโครโฟน เพื่อใช้ฟังก์ชั่นไมโครโฟน
vi: Reoqoo cần bạn cấp quyền sử dụng Micrô để sử dụng tính năng liên lạc nội bộ
zh_hans: Reoqoo需要您允许授权麦克风使用权限，以便使用对讲功能
zh_hant: Reoqoo需要您允許授權麥克風使用權限，以便使用對講功能

# NSLocalNetworkUsageDescription
source: Reoqoo requires your permission to access the local network for device connections.
cs: Reoqoo vyžaduje vaše oprávnění k autorizaci přístupu k lokální síti pro připojení zařízení
fa: Reoqoo requires your permission to authorize local network access for device connections
id: Reoqoo perlu izin Anda untuk mengotorisasi akses jaringan lokal untuk menghubungkan perangkat Anda.
ja: デバイスの接続を行なうには、Reoqooはローカルネットワークへのアクセス権限が必要です
ko: Reoqoo는 장치 연결을 위해 로컬 네트워크 접근을 허용해야 합니다.
ms: Reoqoo memerlukan kebenaran anda untuk mengakses rangkaian tempatan untuk sambungan peranti
sk: Reoqoo vyžaduje vaše povolenie na povolenie miestneho prístupu k sieti pre pripojenia zariadení
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตการเข้าถึงเครือข่ายท้องถิ่น เพื่อการเชื่อต่ออุปกรณ์
vi: Reoqoo cần bạn cấp quyền truy cập mạng cục bộ để kết nối thiết bị
zh_hans: Reoqoo需要您允许授权本地网络访问权限，以便进行设备连接
zh_hant: Reoqoo需要您允許授權本地網絡訪問權限，以便進行設備連接

# NSUserNotificationsUsageDescription
source: Reoqoo requires you to grant permission for push notifications in order to receive device push notifications.
cs: Reoqoo vyžaduje vaše svolení k autorizaci funkce push pro přijímání push oznámení zařízení
id: Reoqoo perlu izin Anda untuk mengotorisasi fungsi push agar dapat menerima pemberitahuan push perangkat.
ja: デバイスのプッシュ通知を受信するには、Reoqooはプッシュ機能の権限が必要です
ko: Reoqoo는 장치 푸시 알림을 받기 위해 푸시 기능을 허용해야 합니다
ms: Reoqoo memerlukan anda memberikan kebenaran untuk pemberitahuan hantaran untuk menerima pemberitahuan hantaran peranti
sk: Reoqoo si vyžaduje vaše povolenie na povolenie tlakovej funkcie s cieľom získať oznámenia o tlaku zariadenia
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตฟังก์ชั่นพุช เพื่อรับอุปกรณ์ฟังก์ชั่นพุช
vi: Reoqoo cần bạn cấp quyền tính năng đẩy để chấp nhận thông báo đẩy của thiết bị
zh_hans: Reoqoo需要您允许授权推送功能，以便接受设备推送通知
zh_hant: Reoqoo需要您允許授權推送功能，以便接受設備推送通知

# NSUserTrackingUsageDescription
source: In order to recommend better intelligent hardware products to you, we need to obtain your IDFA
id: Untuk merekomendasikan produk hardware intelijen kualitas tinggi untuk Anda, kami perlu mendapatkan IDFA Anda
ja: より高品質なスマートハードウェア製品をお勧めするには、IDFAを取得する必要があります
ko: 보다 우수한 지능형 하드웨어 제품을 추천하려면 IDFA 필요
ms: Untuk mencadangkan produk perkakasan cerdas kualiti lebih tinggi kepada anda, kami perlu mendapatkan IDFA anda
th: เพื่อแนะนำผลิตภัณฑ์ฮาร์ดแวร์อัจฉริยะที่มีคุณภาพมากขึ้นจำเป็นต้องได้รับ IDFA ของคุณ
vi: Để giới thiệu cho bạn các sản phẩm phần cứng thông minh chất lượng cao hơn, IDFA của bạn là cần thiết
zh_hans: 为了向您推荐更优质的智能硬件产品，需要获取您的IDFA
zh_hant: 為了向您推薦更優質的智慧硬體產品，需要獲取您的IDFA

# NSBluetoothAlwaysUsageDescription
source: Reoqoo requires your permission to access the Bluetooth in order to access Bluetooth devices.
cs: Reoqoo vyžaduje vaše svolení k autorizaci oprávnění k použití Bluetooth pro přístup k zařízením Bluetooth
fa: Reoqoo requires your permission to authorize Bluetooth usage permissions in order to access Bluetooth devices
id: Reoqoo perlu izin Anda untuk mengotorisasi penggunaan Bluetooth untuk mengakses perangkat Bluetooth.
ja: Bluetooth機器にアクセスするには、ReoqooはBluetoothへのアクセス権限が必要です。
ko: Reoqoo는 블루투스 장치에 접근할 수 있도록 블루투스 접근을 허용해야 합니다
ms: Reoqoo memerlukan kebenaran anda untuk mengakses Bluetooth untuk mengakses peranti Bluetooth
sk: Reoqoo vyžaduje vaše povolenie na povolenie používania Bluetoothu s cieľom prístupu k zariadeniam Bluetooth
th: Reoqoo ต้องได้รับอนุญาตจากคุณในการอนุญาตการใช้บลูทู ธ เพื่อเข้าถึงอุปกรณ์บลูทู ธ
vi: Reoqoo cần bạn cấp quyền sử dụng Bluetooth để truy cập các thiết bị Bluetooth
zh_hans: Reoqoo需要您允许授权蓝牙使用权限，以便访问蓝牙设备
zh_hant: Reoqoo需要您允許授權藍牙使用權限，以便訪問藍牙設備
